In [3]:
import pandas as pd
import numpy as np

In [4]:
df=pd.read_csv('data/survey_results_public.csv')

In [5]:
people={"first":["dwarak","ram","nag"],
       "last":["nath","nath",None],
       "age":["27","45",np.nan]}

In [6]:
data=pd.DataFrame(people)

In [7]:
data

    first  last  age
0  dwarak  nath   27
1     ram  nath   45
2     nag  None  NaN

In [9]:
data.dropna()

    first  last age
0  dwarak  nath  27
1     ram  nath  45

In [15]:
data.dropna(axis='index',how='any') # similar to above

    first  last age
0  dwarak  nath  27
1     ram  nath  45

In [16]:
data.dropna(axis='columns')

    first
0  dwarak
1     ram
2     nag

In [18]:
data.dropna(axis='index', subset=['age'])

    first  last age
0  dwarak  nath  27
1     ram  nath  45

In [19]:
data.replace('NA',np.nan)

    first  last  age
0  dwarak  nath   27
1     ram  nath   45
2     nag  None  NaN

In [20]:
data.isna()

   first   last    age
0  False  False  False
1  False  False  False
2  False   True   True

In [23]:
data.fillna('35',inplace=True)

In [24]:
data.dtypes

first    object
last     object
age      object
dtype: object

In [25]:
type(np.nan)

float

In [26]:
data['age']=data['age'].astype(float)

In [27]:
data['age'].mean()

35.666666666666664

In [28]:
data['age'].mode()

0    27.0
1    35.0
2    45.0
dtype: float64

In [30]:
df['YearsCode'].head()

0      4
1    NaN
2      3
3      3
4     16
Name: YearsCode, dtype: object

In [31]:
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [33]:
df['YearsCode'].replace("Less than 1 year","1", inplace=True)

In [34]:
df['YearsCode'].replace('More than 50 years',"50",inplace=True)

In [36]:
coding_years=df['YearsCode'].astype(float).mean()

In [38]:
df['YearsCode'].fillna(coding_years)

0              4
1        11.6762
2              3
3              3
4             16
          ...
88878    11.6762
88879    11.6762
88880    11.6762
88881    11.6762
88882          8
Name: YearsCode, Length: 88883, dtype: object